saffetblt/ARM-STM32F4-ECLIPSE/STM32F4-DOCUMENT/.cache/Keil.SAMD21_DFP.1.3.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <url>http://www.keil.com/pack/</url>
  <name>SAMD21_DFP</name>
  <description>Microchip SAM D21 Series Device Support and Examples</description>

  <releases>
    <release version="1.3.0" date="2018-05-07">
      Updated device vendor from Microchip to Microchip
      Added SAMD21-XPRO board support.
      Split device support into SAMD21A, SAMD21B (according Microchip).
      Added SAMD21xL device support.
      Reworked Flash Algorithm.
      Added EEPROM Flash Algorithm.
      Updated documentation.
    </release>
    <release version="1.2.0" date="2015-10-09">
      Updated device condition to be more specific to avoid conflict with names of other devices.
    </release>
    <release version="1.1.0" date="2015-04-15">
      Added SAMD21E15BU, SAMD21E16BU device support.
    </release>
    <release version="1.0.0">
      First Release version of SAMD21 Device Family Pack.
    </release>
  </releases>

  <keywords>
  <!-- keywords for indexing -->
    <keyword>Microchip</keyword>
    <keyword>SAM D</keyword>
    <keyword>SAM D21</keyword>
  </keywords>

  <devices>
    <family Dfamily="SAM D Series" Dvendor="Microchip:3">
      <book name="Documents/dui0662a_cortex_m0p_r0p0_dgug.pdf" title="Cortex-M0+ Generic User Guide"/>
      <description>
The Microchip | SMART SAM D ARM Cortex-M0+ based microcontroller (MCU) series builds on decades of innovation and experience in embedded Flash microcontroller technology.
It not only sets a new benchmark for flexibility and ease-of-use but also combines the performance and energy efficiency of an ARM Cortex-M0+ based MCU with an optimized architecture and peripheral set.
The Microchip | SMART SAM D gives you a truly differentiated general-purpose microcontroller that is ideal for many low-power, cost-sensitive industrial and consumer applications.
      </description>

      <!-- ************************  Subfamily 'SAM D21'  **************************** -->
      <subFamily DsubFamily="SAM D21">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p0" Dmpu="NO_MPU" Dfpu="NO_FPU" Dendian="Little-endian" Dclock="48000000"/>

        <book name="Documents/Atmel-42181-SAM-D21_Datasheet.pdf" title="SAM D21 Datasheet"/>
        <description>
A rich set of peripherals, flexibility and ease-of-use combined with low power consumption make the Microchip SAM D21 ARM Cortex-M0+ based microcontroller series
ideal for a wide range of home automation, consumer, metering and industrial applications.
The SAM D21 is designed for simple and intuitive migration between SAM D devices with identical peripheral modules, compatible code and a linear address map.
        </description>

        <feature type="CoreOther"     n="12"                          name="Event System"/>
        <feature type="Touch"         n="1"                           name="Capacitive Touch Inputs"/>
        <feature type="AnalogOther"   n="2"                           name="Analog Comparator"/>
        <feature type="DAC"           n="1"       m="10"              name="DAC"/>
        <feature type="RTC"           n="32768"                       name="RTC"/>
        <feature type="WDT"           n="1"                           name="Watchdog"/>
        <feature type="DMA"           n="12"                          name="DMA channel"/>
        <feature type="ComOther"      n="1"                           name="USB (host/device)"/>
        <feature type="I2S"           n="1"                           name="Inter-IC Sound"/>
        <feature type="ExtInt"        n="16"                          name="External Interrupts"/>
        <feature type="Temp"          n="-40"     m="85"              name="Operating Temperature Range"/>
        <feature type="VCC"           n="1.62"    m="3.63"/>

        <!-- *************************  Device 'ATSAMD21E15A'  **************************** -->
        <device Dname="ATSAMD21E15A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21E15A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21E15A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_32.FLM"  start="0x00000000" size="0x00008000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E15B'  **************************** -->
        <device Dname="ATSAMD21E15B">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21E15B__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21E15B.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00008000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000400"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" default="1" init   ="0"/>
          <algorithm name="Flash/ATSAMD21_32.FLM"         start="0x00000000" size="0x00008000" default="1"/>
          <algorithm name="Flash/ATSAMD21_32_EEPROM.FLM"  start="0x00400000" size="0x00000400" default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E15BU'  *************************** -->
        <device Dname="ATSAMD21E15BU">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21E15BU__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21E15BU.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00008000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000400"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" default="1" init   ="0"/>
          <algorithm name="Flash/ATSAMD21_32.FLM"         start="0x00000000" size="0x00008000" default="1"/>
          <algorithm name="Flash/ATSAMD21_32_EEPROM.FLM"  start="0x00400000" size="0x00000400" default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E15L'  *************************** -->
        <device Dname="ATSAMD21E15L">
          <compile header="Device/SAMD21B/Include/samd21.h" define="__SAMD21E15L__"/>
          <debug svd="SVD/SAMD21B/ATSAMD21E15L.svd"/>
          <memory id="IROM1"                              start="0x00000000" size="0x00008000" default="1" startup="1"/>
          <memory id="IROM2"                              start="0x00400000" size="0x00000400"/>
          <memory id="IRAM1"                              start="0x20000000" size="0x00001000" default="1"/>
          <algorithm name="Flash/ATSAMD21_32.FLM"         start="0x00000000" size="0x00008000" default="1"/>
          <algorithm name="Flash/ATSAMD21_32_EEPROM.FLM"  start="0x00400000" size="0x00000400" default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
        </device>

        <!-- *************************  Device 'ATSAMD21E16A'  **************************** -->
        <device Dname="ATSAMD21E16A">
          <compile header="Device/SAMD21A/Include/samd21.h" define="__SAMD21E16A__"/>
          <debug svd="SVD/SAMD21A/ATSAMD21E16A.svd"/>
          <memory      id="IROM1"                  start="0x00000000" size="0x00010000" startup="1" default="1"/>
          <memory      id="IRAM1"                  start="0x20000000" size="0x00002000" init   ="0" default="1"/>
          <algorithm name="Flash/ATSAMD21_64.FLM"  start="0x00000000" size="0x00010000"             default="1"/>

          <feature type="IOs"           n="26"                          name="Inputs/Outputs"/>
          <feature type="MPSerial"      n="4"                           name="SERCOMM (I2C, USART, SPI)"/>
          <feature type="ADC"           n="10"       m="12"             name="ADC"/>
          <feature type="Timer"         n="6"        m="32"             name="Timer/Counter Module"/>
          <feature type="QFN"           n="32"                          name="QFN Package"/>
          <feature type="QFP"           n="32"                          name="TQFP Package"/>
          <feature type="BGA"           n="32"                          name="UFBGA Package"/>
        </device>

